{"pages":[{"url":"/pages/../about.html","text":"I was born in Guangzhou, China and like hundreds of ordinary Chinese families in Canton area, my family moved to U.S. when I was a high school senior. Have been a stats geek ever since I got a book by my teacher as a farewell gift called \"What is a p-value anyway?\". After graduating from UCLA, I have been working as data scientist in Silicon Valley, I'm enthusiastic about statistics, machine learning, and big data technologies, with experiences in various fields including marketplace dynamic, finance, fraud and etc. I'm actively looking for opportunities where my expertise can be applied. I'm active in many kinds of sports such as basketball, swimming and snowboarding. I also love hiking and traveling. Summer and beach are always my good friends.","tags":"Python","title":"About"},{"url":"/fall-off-the-bike.html","text":"Today is a bad day. I fell off my bike (bicycle, not motorcycle), and it was my first time falling off. As I did not have any protection, except my helmet of course, and it was in a pretty damn fast speed, so my legs and knees were bruised. Most sadly, my bike crashed on the ground and the handler was deformed. Yup, I bought a new bike a month ago and was about to ride it to work on a daily basis. This morning I was trying to get familiar with the route from home to the office. It was Market St. There was a bus stoping in front of me blocking half of the road. I wanted to accelerate and pass it on the left (yes right? You know you won't stop if you are on a two-wheeled machine). How the hell I could not know there are muni tracks on the middle of Market St (yes right? I must have been living in the city for too long to notice it). I should have noticed it, or I should have never passed buses like that, at least not on Market St. When I saw that track, it was already too late. I fell off at about 10 feet away from the bus's front wheel. Fortunately, the bus had not moved yet. It was pretty dangerous when I look back it now. For those who know me enough, they know I often watch video clips like \"top 100 car crashes\", \"Fetal car accidents\" or something like that on Youtube, which is kind of weird. I don't know why I like it but I know it reminds me that I need to be always cautious on the road because there are crazy drivers anywhere. They are super dangerous! I loving biking, either bicycle or motorcycle. I'm kind of mad at myself now as not ever having my own motorcycle even although I had a M1 license 6 years ago. I never got any supports when I said \"I'm gonna to buy a bike.\" I understand it not safe and it seems immature in some sense, but should I just be immature at that age? I would not regret even if I fell off from my own bike if I had one, but I kind of regret I have never had one. Gotta fix my bike soon, meh...","tags":"life","title":"Fall Off the Bike"}]}